{
	"_meta": {
		"sources": [
			{
				"json": "Cosmonauts",
				"abbreviation": "Cos",
				"full": "Trip trough the cosmos",
				"authors": [
					"Vito"
				],
				"convertedBy": [
					"Vito"
				],
				"version": "1.0.0",
				"url": "",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1604879123,
		"dateLastModified": 1604879123
	},
	"race": [
		{
			"name": "Warforged",
			"source": "Cosmonauts",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"ability": [
				{
					"con": 2
				}
			],
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
                        "The maximum lifespan of the warforged remains a mystery; so far, warforged have shown no signs of deterioration due to age."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Most warforged take comfort in order and discipline, tending toward law and neutrality, but some have absorbed the morality—or lack thereof—of the beings they served with."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Your size is medium. Warforged are generally broader and heavier than humans ranging between 250 and 300 pounds."
					]
				},
				{
                    "name": "Construct's Resilience",
					"entries": [
						"You were created to have remarkable fortitude, represented by the following benefits:",
						{
							"type": "list",
							"items": [
								"You are inmune to poison damage and the poisoned condition.",
								"You are immune to 'normal' biological diseases (by example you can get infected by a wood mold, if your warforged is made of that material).",
								"You don't need to eat, drink, or breathe.",
								"You don't need to sleep, and magic can't put you to sleep."
							]
						}
					]
				},
				{
					"name": "Sentry's Rest",
					"entries": [
						"When you take a long rest, you must spend at least four hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you unconscious, and you can see and hear as normal."
					],
					"type": "entries"
				},
				{
					"name": "Integrate element",
					"entries": [
                        "Warforgeds were made in the periods of war by the most geniuses artificers, they were quite expensive to make which make their numbers very limited, but a new breakthrough in alchemy (Organic Metal) made posible to produce Warforgeds in mass.",
                        "As long as you are in direct contact with any inorganic material, you can fully fuse it with your body. It takes an hour of preparation, defusing requires an action. The only way to forcefully remove a fused element would be to chop off the part of your body fused to it"
					],
					"type": "entries"
                },
                {
					"name": "Integrate protection",
					"entries": [
                        "You can enhance your protection by using 'Integrate element' on your armor. While fused with it you gain +1 AC and you need to have that armor proficiency to fuse with it."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Binary, Common and the language of your creator/one of your choice."
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Explorer",
					"ability": [
						{
							"dex": 1
						}
					],
					"entries": [
						{
							"name": "Adaptive Plating",
							"entries": [
								"You are adapted to Extreme Heat, Extreme Cold, and Frigid Water as described in chapter 5 of the Dungeon Master's Guide."
							],
							"type": "entries"
						}
					]
                },
                {
					"name": "Focused",
					"ability": [
						{
							"choose": {
                                "from": [
                                    "int",
                                    "wis"
                                ],
                                "count": 1,
                                "amount": 1
                            }
						}
					],
					"entries": [
                        {
							"name": "Enhancements baby",
							"entries": [
                                "Your creator gave you an expanded set of logic abilities and another pair of arms to perform precise magic incantaitions."
							],
							"type": "entries"
                        },
						{
							"name": "Double casting",
							"entries": [
                                "To use this feature you will need 2 focuses (one in each hand) and 2 free hands. You are able to concentrate in 2 spells at the same time.",
                                "Moving, talking or using your action in a way not inherently related to the spell effect (by example using the 'interact with object' action) while using this feature will stop one spell effect, choose which one. It is allowed to use actions related to the spells you are casting (by example to use Dragon's Breath effect as your action)."
							],
							"type": "entries"
                        },
                        {
							"name": "Powerful casting",
							"entries": [
								"To use this feature you will need 2 focuses (one in each hand) and 2 free hands, if the spell requires a material component you will need double of that material to be able to use this feature.",
								"After taking 8 hours of preparation in which you attune to the magic energy of the surrounding ambient, and nothing more, you are able to choose one of the following effects for you next spell:",
                                {
                                    "type": "list",
                                    "items": [
                                        "Double range of the effect",
                                        "Double the area of the effect",
                                        "Double the duration of the effect",
                                        "Choose one target more, it recives the same spell effects",
										"Any weight limit is doubled",
										"Other spell effects may be posible to 'double', DM discretion, but spell stacking doesn't work (PHB pg 205)"
                                    ]
								},
								"{@bold You gain 2 levels of exhaustion after using this feature.}",
								"Moving, talking or using your action in a way not inherently related to the spell effect (by example using the 'interact with object' action) while using this feature will stop the spell effect. It is allowed to use actions related to the spells you are casting (by example to use Dragon's Breath effect as your action)."
							],
							"type": "entries"
						}
					]
                },
                {

					"name": "Juggernaut",
					"ability": [
						{
							"str": 1
						}
					],
					"entries": [
						{
							"name": "Powerful Build",
							"entries": [
								"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
							],
							"type": "entries"
						}
					],
					"traitTags": [
						"Powerful Build"
					]
				},
                {
					"name": "Sentry",
					"ability": [
						{
							"wis": 1
						}
					],
					"entries": [
						{
							"name": "Keen Sensors",
							"entries": [
								"You have proficiency in the Perception skill and you can accurately recall anything you have seen or heard within the past day"
							],
							"type": "entries"
						}
					],
					"traitTags": [
						"Skill Proficiency"
					]
				},
                {
					"name": "Specialist",
					"ability": [
						{
							"choose": {
                                "from": [
                                    "str",
                                    "dex",
                                    "int",
                                    "wis",
                                    "cha"
                                ],
                                "count": 1,
                                "amount": 1
                            }
						}
					],
					"entries": [
						{
							"name": "The right Machine for the job",
							"entries": [
                                "Choose one of the following:",
                                {
                                    "type": "list",
                                    "items": [
                                        "You gain expertise in one tool which is infused into your body, to use it you must have both hands free.",
                                        "You gain proficiency in one skill and fluency in one language of your choice"
                                    ]
                                }
								
							],
							"type": "entries"
						}
					],
					"traitTags": [
						"Tool Proficiency"
					]
                },
                {
					"name": "Spy",
					"ability": [
						{
							"dex": 1
						}
					],
					"entries": [
						{
							"name": "'Eficient' movement",
							"entries": [
								"Your walking speed increases by 5 feet"
							],
							"type": "entries"
						},
						{
							"name": "Octopus Skin",
							"entries": [
								"Your original creator found a way to infuse bio material in your body, your skin changes color and shape to adapt to the ambient you are in. You gain a +2 in the stealth skill."
							],
							"type": "entries"
                        }
					]
				}
			],
			"traitTags": [
				"Improved Resting",
				"Natural Armor"
			],
			"languageProficiencies": [
				{
					"other": true,
					"common": true,
					"anyStandard": 1
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"disease"
			]
		},
		{
			"name": "Takofolk",
			"source": "Cosmonauts",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"entries": [
				{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Most Takofolks live between 300 & 400 years, but it's not rare to find one who has surpased this mark, after all, mechanical enhancements are as common as tatoos in the takofolkian civilization.",
						"Hearts of steel, minds of circuits and rocket legs are a great way to cheat on death."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Takofolks live between the extremes of order and chaos, in the mainland takofolks are the best example of Mechanus in the material plane, everything it's on it's place at the perfect moment. The thing that differs Takofolks from pure order it's their approach to invention, most of history's greatest inventions were mere accidents, after all innovation is submerged in a sea of chaos and uncertanty. That's why takofolkian Outsiders are more prone to chaos and experimentation, they in a way are what power scintific advancement."
					]
				},
				{
					"name": "Size",
					"type": "entries",
					"entries": [
						"Your size is medium."
					]
				},
				{
					"name": "Darkvision",
					"type": "entries",
					"entries": [
						"Accustomed to life underwater, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light."
					]
				},
				{
					"name": "Slippery hands",
					"entries": [
                        "Your arms and hands are incredible precice and nimble, you gain a +2 in Sleight of Hand checks"
					],
					"type": "entries"
				},
				{
					"name": "Ink spray",
					"entries": [
                        "You spray ink up to 10ft. A creature must succed a Dex saving throw against your Dexterity DC (8 + Proficiency + Dexterity), if it fails it becomes blinded till the begining of you next turn (The creature can also choose to clean it's eyes with water with his action). If the creature it's invisible it becomes visible."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Takofolkian/Abyssal and Common"
					],
					"type": "entries"
				}
			],
			"subraces": [
				{
					"name": "Drone",
					"ability": [
						{
							"dex": 2,
							"con": 1
						}
					],
					"entries": [
						{
							"name": "Almost boneless",
							"entries": [
								"Your bone structure is incredibly flexible. You can squish trough any hole at least bigger than your skull (Approximately 1ft. diameter)"
							],
							"type": "entries"
						},
						{
							"name": "Water adaptability",
							"entries": [
								"You can move at the same speed as you would normally on land, in water, and you can also breath underwater. You can hold you breath for 10 minutes + Constitution."
							],
							"type": "entries"
						}
					]
				},
                {
					"name": "Outsider",
					"ability": [
						{
							"dex": 2,
							"int": 1
						}
					],
					"entries": [
						{
							"name": "Octopus skin",
							"entries": [
								"Your skin is capable of changing color and texture to more easily adapt to your enviroment, this ability requieres a great coordination between your limbs neurons and your eyes to control every deatil to it's finest. When you would roll a stealth check you can roll with Intelligence instead of Dexterity."
							],
							"type": "entries"
						},
						{
							"name": "Water resistant",
							"entries": [
								"You can hold you breath for 10 minutes + Constitution."
							],
							"type": "entries"
						}
					]
				},
				{
					"name": "Worker",
					"ability": [
						{
							"int": 2,
							"wis": 1
						}
					],
					"entries": [
						{
							"name": "Specialiced work",
							"entries": [
								"You gain proficiency in two sets of Artisian's Tools"
							],
							"type": "entries"
						},
						{
							"name": "Water adaptability",
							"entries": [
								"You can move at the same speed as you would normally on land, in water, and you can also breath underwater. You can hold you breath for 10 minutes + Constitution."
							],
							"type": "entries"
						}
					]
				}
			],
			"traitTags": [
				"Darkvision",
				"Uncommon Race"
			],
			"languageProficiencies": [
				{
					"other": true,
					"common": true,
					"anyStandard": 1
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"disease"
			]
		}
	],

	"class": [{
		"name": "Bard",
		"source": "PHB",
		"page": 51,
		"srd": true,
		"hd": {
			"number": 1,
			"faces": 8
		},
		"classFeatures": ["Art School|Bard||1|Cosmonauts"]
	}],
	
	"classFeature": [{
		"name": "Art School",
		"source": "Cosmonauts",
		"page": 48,
		"className": "Bard",
		"classSource": "PHB",
		"level": 2,
		"isClassFeatureVariant": true,
		"entries": ["{@i 1st-level bard {@variantrule optional class features|cosmonauts|optional feature}}", "ex", "ex"]
	}],

	"subclass": [
		{
			"name": "College of Images",
			"shortName": "Images",
			"source": "Cosmonauts",
			"page": 4,
			"subclassFeatures": [
				"College of Images|Bard||Images|Cosmonauts|3",
				"New insigth|Bard||Images|Cosmonauts|6",
				"Redraw|Bard||Images|Cosmonauts|6",
				"Create masterpiece|Bard||Images|Cosmonauts|14"
			],
			"className": "Bard",
			"classSource": "PHB"
		}		
	],
	"subclassFeature": [

		{
			"name": "College of Images",
			"source": "Cosmonauts",
			"page": 4,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Images",
			"subclassSource": "Cosmonauts",
			"level": 3,
			"entries": [
			{
				"type": "quote",
				"entries": [
					"- 'An artist isn't adept for war...' Pff that's what that old man said, can you believe him? Anyway now lay still while i capture your essence",
					"- How much longer darling? My arms are getting tired",
					"- Just a tiny bit more, im still working on those beautiful legs of yours.. Agh needs more green...",
					"- And if we were, mhh... let say asualted by pirates, would you fight side by side with me?",
					"- *gulp* Of course darling..."
				],
				"by": "Jane Luc",
				"from": "My life: Pirates, floating ships & other adventures"
			},
			"Bards from the College of Images are very scarce, most of them are failed music students who couldn't pass the first year of music theory. Most people describe them as more excentric than other bards, and rarely participate in any wars or combats. Most of them prefer to seclude themself in a coozy wood cabin with a great view, but sometimes you can see them in big cities selling their works.",
			{
				"name": "Draw me like one of your goblin girls",
				"entries": [
					"At 3rd level, you combine perfectly your artistict style with magic. You can now use drawings as a focus to cast your bard spells without the need of a painter's Supplies, this can be a drawing with a pencil on a sheet of paper or something more rustic, like drawings on the sand.",
					"You also learn the minor illusion cantrip. If you already know this cantrip, you learn a different bard cantrip of your choice. The cantrip doesn't count against your number of cantrips known."
				]
			},
			{
				"name": "Redraw",
				"entries": [
					"At 3rd level you can cover your friends with a mantle of illusions or simply enhance abilities, you will need to have Painter's Supplies to use this ability. You can use this ability equal times to your proficiency bonus, choose one of this effects:",
					{
						"type": "list",
						"items": [
							"{@bold Give them Hell & Ink.} As a reaction when a creature within 30f. of you, makes an attack and hits, you can redraw the weapons and magic used in that attack to enhance them. You can add your bardic inspiration dice to the damage calculation.",
							"{@bold Restyle OC.} As a bonus action you can touch and redraw a willing creature, you may change their height (2ft. max), weight, facial features, hair length, coloration, distinguishing characteristics and clothing. You can make them appear as a member of another race, though none of your statistics change. The size of the creature can't change. If you're bipedal, you can't use this spell to become quadrupedal. <br></br> You can also choose to draw gills and scales on a creature. That creature can now breathe underwater and gain a swimming speed equal to their walking speed. And also to draw monkey paws or spider legs, this will the creature climbing speed equal to it's walking speed. <br></br> You can't use this feature more than once effect on each creature, and this feature requires concentration but you can stack this feature as a single concentration effect which lasts 1 hour. This ability is not an illusion, it's thaumaturgy."
						]
					}
				]
			}
		]},
		{
			"name": "New insigth",
			"source": "Cosmonauts",
			"page": 4,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Images",
			"subclassSource": "Cosmonauts",
			"level": 6,
			"entries": [

				"At 6th level you can now prepare any spell of the illusion school (regardless of class limitation) as if it was a bard spell."

			]
		},

		{
			"name": "Redraw",
			"source": "Cosmonauts",
			"page": 4,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Images",
			"subclassSource": "Cosmonauts",
			"level": 6,
			"entries": [

				"As part of your 3rd level Redraw ability you may also use this option:",
				{
					"type": "list",
					"items": [
						"{@bold Origami replica.} Folding paper you can create very interesting objects. As an action you can create an object that must fit in a 5ft. cubic space. You can choose it to be metal or gems but it can't be a precious one. After a minute has passed since you used this ability the object you created turns into a paper version of itself."
					]
				}

			]
		},
		{
			"name": "Create masterpiece",
			"source": "Cosmonauts",
			"page": 4,
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Images",
			"subclassSource": "Cosmonauts",
			"level": 14,
			"entries": [
				"At 14th level you gain the ability to imbue you paintings with magic, you will need to have Painter's Supplies to use this feature, which this ability consumes and one painting surface (portrait, wall, piece of paper, sand). This feature allows you to store Spells inside your paintings, they count as spell scrolls. Choose a Spell you want to store in a painting, the painting takes Spell Level x Hours to complete, you can't interupt this process for more than 30 minutes, if you do you loose the Spell Slot. After that time has pased roll a performance check, you can add your bardic inspiration roll to this check. You must pass a DC equal to 10 + (Spell Level x 4), if you pass the DC the choosed spell gets stored in the painting. If you fail the spell slot is wasted and the painting turns out horrible. You can have magic paintings equal to your Charisma modifier, making a new one after reaching maximum will destroy the oldest one. If you were to die your paintings remain usable as scrolls for months multiplied by your charisma modifier."
			]
		}
	],

	"monster": [
		{
			"name": "Messenger of the Nine Hells",
			"shortName": "Messenger",
			"source": "Cosmonauts",
			"size": "M",
			"type": {
				"type": "humanoid",
				"tags": [
					{
						"tag": "Fiend Demon",
						"prefix": "Construct /"
					}
				]
			},
			"alignment": [
				"L",
				"E"
			],
			"ac": [
				{
					"special": "22, When outside of puppet 18"
				}
			],
			"hp": {
				"special": "20, When outside of puppet 127 (15d10 + 45)"
			},
			"speed": {
				"walk": {
					"number": 25,
					"condition": "(35ft. when outside of puppet)"
				}
			},
			"str": 14,
			"dex": 17,
			"con": 16,
			"int": 19,
			"wis": 18,
			"cha": 21,
			"save": {
				"con": "+7",
				"int": "+8",
				"wis": "+8",
				"cha": "+9"
			},
			"skill": {
				"deception": "+9",
				"intimidation": "+9",
				"persuasion": "+9",
				"insight": "+8"
			},
			"senses": [
				"blindsight 300 ft.",
				"darkvision 5 ft."
			],
			"passive": 14,
			"resist": [
				"cold",
				"fire",
				"lightning",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks"
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"poisoned"
			],
			"languages": [
				"Abyssal",
				"Common",
				"telepathy 300 ft."
			],
			"cr": "10",
			"spellcasting": [
				{
					"name": "6. Innate Spellcasting",
					"headerEntries": [
						"The master's innate spellcasting ability is Charisma (spell save {@dc 17}). The master can innately cast the following spells, requiring no material components:"
					],
					"will": [
						"{@spell charm person} (as a 3rd-level spell)",
						"{@spell crown of madness}",
						"{@spell disguise self}",
						"{@spell eldritch blast} (As 11th level spellcater, +5 damage)",
						"{@spell enlarge/reduce}",
						"{@spell expeditious retreat}",
						"{@spell longstrider}"
					],
					"daily": {
						"1": [
							"{@spell dominate person}"
						]
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "4. Aura of Blood Lust",
					"entries": [
						"When any other creature starts its turn within 30 feet of the master, that creature must succeed on a {@dc 17} Wisdom saving throw, or it must immediately take the Attack action, making one melee attack against a random creature within reach. If no creatures are within reach, it makes a ranged attack against a random creature within range, throwing its weapon if necessary."
					]
				},
				{
					"name": "5. Feed on the Crowd",
					"entries": [
						"Whenever a creature within 60 feet of the Messenger dies, the Messenger gains 15 temporary hit points and has advantage on all attack rolls, ability checks, and saving throws until the end of its next turn."
					]
				},
				{
					"name": "3. Magic Resistance",
					"entries": [
						"The Messenger has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "1. Puppet of Adamantium",
					"entries": [
						"The Messanger rests it's body inside a magical Adamantium Puppet. While inside of it the Messeger gets (as writed before) a +4AC, and 20HP separeted from it's own HP, It's percived as a CR 2 Humanoid Construct but it's true nature is of a CR 10 Humanoid Fiend. ",
						"If the Messanger it's not calm, any creature within 10ft. of him can see Fiendish caracteristics forming. Otherwise only a Level 9+ Paladin can detect fiendish presence using Divine Sense and only if they are touching them, a 13+ level Paladin can use Divine Sense normally on this creature. Level 4+ Spells can also detect it's demonic presence.",
						"Furthermore when inside if the Messenger were to attack the it can only use it's Claws attack. Any damaging spell does half damage unless it's a cantrip.",
						"When the first set of HP reaches 0 the Puppet Breaks, any surplus damage it's made to the Messanger true HP. All limitations and buffs the Puppet gives are removed and the Messenger becomes a Large creature.",
						"The puppet can't be reconstructed except by a 6th level artificer, Proficiency in Smith's Tools DC18 and Arcana DC18 with a magical Infernal Flame."
					]
				},
				{
					"name": "2. Puppet of Adamantium, Infernal Charge",
					"entries": [
						"As an action the Messenger can charge magic into the puppet making him resistant to all damage for an hour, in this state the Messenger looses 5ft of walking speed, and damaging spells deal no damage (but apply effects) unless they are a cantrip."
					]
				},
				{
					"name": "7. Quickfoot",
					"entries": [
						"While being calm and not feeling danger nearby the messenger walking speed increases by 25ft."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"If inside the puppet the Messenger makes one Claw attack otherwise it makes two melee attacks with its Great Claw."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}8 ({@damage 1d6 + 4}) piercing damage, plus 5 ({@damage 1d8}) psychic damage."
					]
				},
				{
					"name": "Great Claw",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft. or range 20/60 ft., one target. 13 ({@damage 2d8 + 4}) piercing damage, plus 13 ({@damage 3d8}) psychic damage."
					]
				},
				{
					"name": "Captivating Presence {@recharge}",
					"entries": [
						"Each creature within 120 feet of the Messenger must succeed on a {@dc 17} Wisdom saving throw or be {@condition charmed} by the Messenger for 1 hour. While {@condition charmed} in this way, a creature's speed is 0. If the {@condition charmed} creature takes damage, it can repeat the saving throw, ending the effect on itself on a success. A target that succeeds on the saving throw is immune to the Captivating Presence of all Messengers of Nine Hells for the next 24 hours."
					]
				}
			],
			"environment": [
				"roads",
				"urban"
			],
			"fluff": {
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											"When a master of cruelties steps up as ringleader of a Rakdos show, the audience can be assured of a performance they will remember for the rest of their lives—however brief that might be.",
											"The mesmerizing presence of a master of cruelties draws every eye to the demon and commands an audience's full attention. With every act of depraved torment the demon performs, onlookers are drawn more and more into the blood lust. Audiences clamor for more violence, and those who get too caught up in the revelry feel compelled to partake in the indiscriminate killing."
										]
									},
									{
										"type": "entries",
										"name": "Demons",
										"entries": [
											"Just as angels are incarnations of the ideals of justice, demons embody depraved impulses: selfishness, cruelty, hatred, greed, and lust for power. Demons are strongly associated with the Cult of Rakdos; in fact, the demons of Ravnica might have been created by Rakdos in the same way that angels were created by the Boros Legion's founder. As a demon lord who has chosen to live in Ravnica, Rakdos claims authority over all the demons of this world-even if some of them, ambitious and headstrong as demons are, rebel against his authority.",
											"Demons are agents of destruction that work their acts of terror in plain sight under the auspices of the Cult of Rakdos. They exhibit their cruelty in dramatic performances that leave the audience members blood-soaked but ecstatic. They incite mob riots that raze entire city blocks. The only thing demons fear is Rakdos himself, who doesn't tolerate rivals and hates to be upstaged.",
											{
												"name": "Demonic \"Devils.\"",
												"type": "entries",
												"entries": [
													"The creatures called \"devils\" in Ravnica are minor demons akin to quasits. While the larger demons embody evil qualities such as blood lust and torment, these lesser demons reflect the whimsical and chaotic side of Rakdos and his cult. Their mischievous antics cause disorder and destruction out of proportion to the demons' small size."
												]
											},
											{
												"name": "Diabolic Demons",
												"type": "entries",
												"entries": [
													"Many of the demons of Ravnica are monstrous, winged creatures of human-like form. They are best represented by the statistics of the nalfeshnee, the shadow demon, or the vrock in the Monster Manual. Demons associated with the Cult of Rakdos often have fiery attacks that make them similar to barbed devils or horned devils, except that they are demons. (They are chaotic evil, they speak Abyssal and not Infernal, and they lack Devil's Sight.)"
												]
											}
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://5e.tools/img/bestiary/GGR/Master of Cruelties.jpg"
						}
					},
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://www.craftsmanshipmuseum.com/images/HoArt4.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/GGR/Master of Cruelties.png?v=1.122.6",
			"senseTags": [
				"B",
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"AB",
				"C",
				"TP"
			],
			"damageTags": [
				"P",
				"Y"
			],
			"spellcastingTags": [
				"I"
			],
			"miscTags": [
				"AOE",
				"MW"
			],
			"conditionInflict": [
				"charmed"
			],
			"conditionInflictSpell": [
				"charmed"
			],
			"hasFluff": true,
			"hasFluffImages": true
		},
		{
			"name": "Avatar of War (Stage 1)",
			"shortName": "Avatar",
			"group": "Angels",
			"source": "Cosmonauts",
			"size": "L",
			"type": "celestial",
			"alignment": [
				"L",
				"G"
			],
			"ac": [
				{
					"ac": 18,
					"from": [
						"unarmored defense"
					]
				}
			],
			"hp": {
				"average": 136,
				"formula": "16d8 + 64"
			},
			"speed": {
				"walk": 30,
				"fly": 90
			},
			"str": 18,
			"dex": 18,
			"con": 18,
			"int": 17,
			"wis": 20,
			"cha": 20,
			"save": {
				"str": "+8",
				"con": "+8"
			},
			"skill": {
				"insight": "+9",
				"perception": "+9",
				"athletics": "+8"
			},
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 19,
			"resist": [
				"radiant",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks",
					"cond": true
				}
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"frightened"
			],
			"languages": [
				"all",
				"telepathy 120 ft."
			],
			"cr": "10",
			"spellcasting": [
				{
					"name": "Innate Spellcasting",
					"headerEntries": [
						"The Avatars's spellcasting ability is Charisma (spell save {@dc 17}). The deva can innately cast the following spells, requiring only verbal components:"
					],
					"daily": {
						"1e": [
							"{@spell raise dead}"
						]
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Angelic Weapons",
					"entries": [
						"The Avatar's weapon attacks are magical. When the Avatar hits with any weapon, the weapon deals an extra {@damage 4d8} radiant damage (included in the attack), it deals {@damage 1d8} extra damage to undead and fiends."
					]
				},
				{
					"name": "Godly Sense",
					"entries": [
						"The Avatar knows if there is an Aberration, Fiend, or Undead within 120 feet of them, as well as where the creature is located. Similarly, the Avatar knows if there is a place or object within 120 feet of them that has been magically consecrated or desecrated.",
						"This sense can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
						"Aberrations, Fiends and Undeads can feel the effects of this trait as someone stompimg on their chest, making it hard to breath."
					]
				},
				{
					"name": "Magic Resistance",
					"entries": [
						"If the Avatar is fighting alone it has advantage on saving throws against spells and other magical effects."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The deva makes two melee attacks."
					]
				},
				{
					"name": "Mace",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}7 ({@damage 1d6 + 4}) bludgeoning damage plus 18 ({@damage 4d8}) radiant damage, {@damage 1d8} extra damage to undead and fiends."
					]
				}
			],
			"bonus": [
				{
					"name": "Rage (3/Day)",
					"entries": [
						"As a bonus action the Avatar can enter in Rage. While raging, the Avatar gains the following benefits:",
						"- The Avatar has advantage on Strength checks and Strength saving throws.",
						"- The Avatar gains a +2 bonus to the damage roll of melee weapons.",
						"- The Avatar gains resistance to bludgeoning, piercing, and slashing damage.",
						"The Avatar, can't cast spells or concentrate on them while raging.",
						"Your rage lasts for 1 minute. It ends early if you are knocked {@condition unconscious} or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action."
					]
				}
			],
			"reaction": [
				{
					"name": "Reborn",
					"entries": [
						"If the Avatar where to recive a final blow it can use it's reaction to contact the Avatar of Knowledge, who teleports him to The Shun palace. This teleport overrides teleporting limitations and doesn't need to throw in the Telpoting Mishaps Table. After a day of recovering the Avatar increases it's power, learning from it's previous defeat, Avatar of War (Stage 2) replaces this NPC. ",
						"As a blueish dome of force appears near the Avatar of War it stops the final blow. If that blow was made with a melee weapon with a rarity of uncommon or less it shatters, if the rarity is rare it needs to be repared in a forge."
					]
				}
			],
			"fluff": {
				"name": "Deva",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"An angel is a celestial agent sent forth into the planes to further its god's agenda for weal or woe. Its sublime beauty and presence can drive awestruck onlookers to their knees. Yet angels are destroyers too, and their appearance portends doom as often as it signals hope.",
									{
										"name": "Shards of the Divine",
										"type": "entries",
										"entries": [
											"Angels are formed from the astral essence of benevolent gods and are thus divine beings of great power and foresight.",
											"Angels act out the will of their gods with tireless devotion. Even chaotic good deities command lawful good angels, knowing that the angels' dedication to order best allows them to fulfill divine commands. An angel follows a single driving purpose, as decreed by its deity. However, an angel is incapable of following commands that stray from the path of law and good.",
											"An angel slays evil creatures without remorse. As the embodiment of law and good, an angel is almost never mistaken in its judgments. This quality can create a sense of superiority in an angel, a sense that comes to the fore when an angel's task conflicts with the goals of another creature. The angel never acquiesces or gives way. When an angel is sent to aid mortals, it is sent not to serve but to command. The gods of good therefore send their angels among mortals only in response to the most dire circumstances."
										]
									},
									{
										"name": "Fallen Angels",
										"type": "entries",
										"entries": [
											"An angel's moral compass grants it a sense of infallibility that can sometimes spell its undoing. Angels are usually too wise to fall for a simple deception, but sometimes pride can lead one to commit an evil act. Whether intentional or accidental, such an act is a permanent stain that marks the angel as an outcast. Fallen angels retain their power but lose their connection to the deities from which they were made. Most fallen angels take their banishment personally, rebelling against the powers they served by seeking rulership over a section of the Abyss or a place among other fallen in the hierarchy of the Nine Hells. Zariel, the ruler of the first layer of the Nine Hells, is such a creature. Rather than rebel, some fallen angels resign themselves to an isolated existence on the Material Plane, living in disguise as simple hermits. If they are redeemed, they can become powerful allies dedicated to justice and compassionate service."
										]
									},
									{
										"name": "Immortal Nature",
										"type": "entries",
										"entries": [
											"An angel doesn't require food, drink, or sleep."
										]
									},
									{
										"type": "entries",
										"name": "Deva",
										"entries": [
											"Devas are angels that act as divine messengers or agents to the Material Plane, the Shadowfell, and the Feywild and that can assume a form appropriate to the realm they are sent to.",
											"Legend tells of angels that take mortal form for years, lending aid, hope, and courage to goodhearted folk. A deva can take any shape, although it prefers to appear to mortals as an innocuous humanoid or animal. When circumstances require that it cast off its guise, a deva is a beautiful humanoid-like creature with silvery skin. Its hair and eyes gleam with an unearthly luster, and large feathery wings unfurl from its shoulder blades."
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Deva.jpg"
						}
					}
				]
			},
			"tokenUrl": "https://5e.tools/img/MM/Deva.png?v=1.122.8",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/deva.mp3?v=1.122.8"
			},
			"traitTags": [
				"Magic Resistance"
			],
			"senseTags": [
				"SD"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"TP",
				"XX"
			],
			"damageTags": [
				"B",
				"R"
			],
			"spellcastingTags": [
				"I"
			],
			"miscTags": [
				"MW"
			],
			"hasFluff": true,
			"hasFluffImages": true
		}
	]
}

